cases/Re100/Re100_coarse/system/blockMeshDict
FoamFile
{
version     2.0;
format      ascii;
class       dictionary;
object      blockMeshDict;
}

convertToMeters 1;

vertices
(
(0 2 0) // 0
(0 5 0) //1
(10 2 0) // 2
(10 5 0) // 3
(13 0 0) // 4
(13 5 0) // 5
(23 0 0) // 6
(23 5 0) // 7
(26 2 0) // 8
(26 5 0) // 9
(36 2 0) // 10
(36 5 0) // 11

(0 2 1) // 12
(0 5 1) // 13
(10 2 1) // 14
(10 5 1) // 15
(13 0 1) // 16
(13 5 1) // 17
(23 0 1) // 18
(23 5 1) // 19
(26 2 1) // 20
(26 5 1) // 21
(36 2 1) // 22
(36 5 1) // 23
);

blocks
(
hex (0 2 3 1 12 14 15 13) (45 23 1) simpleGrading (1 1 1)
hex (2 4 5 3 14 16 17 15) (18 23 1) simpleGrading (1 1 1)
hex (4 6 7 5 16 18 19 17) (45 23 1) simpleGrading (1 1 1)
hex (6 8 9 7 18 20 21 19) (18 23 1) simpleGrading (1 1 1)
hex (8 10 11 9 20 22 23 21) (45 23 1) simpleGrading (1 1 1)
);

boundary
(
inlet
{
type patch;
faces
(
(0 1 13 12)
);
}

outlet
{
type patch;
faces
(
(10 11 23 22)
);
}

walls
{
type wall;
faces
(
(1 3 15 13)
(3 5 17 15)
(5 7 19 17)
(7 9 21 19)
(9 11 23 21)

(0 12 14 2)
(2 14 16 4)
(4 16 18 6)
(6 18 20 8)
(8 20 22 10)
);
}

frontAndBack
{
type empty;
faces
(
(0 2 3 1)
(2 4 5 3)
(4 6 7 5)
(6 8 9 7)
(8 10 11 9)

(12 13 15 14)
(14 15 17 16)
(16 17 19 18)
(18 19 21 20)
(20 21 23 22)
);
}
);

mergePatchPairs
(
);
