cases/Re100/Re100_coarse/constant/physicalProperties
FoamFile
{
version 2.0;
format ascii;
class dictionary;
object transportProperties;
}

viscosityModel constant;

nu [0 2 -1 0 0 0 0] 1.6e-05;
